---
kind: method
id: M:Autodesk.Revit.DB.ExportLayerTableIterator.Reset
source: html/2157c558-75e5-bd2d-ad08-f0f02c825680.htm
---
# Autodesk.Revit.DB.ExportLayerTableIterator.Reset Method

Resets the iterator to the initial state.

## Syntax (C#)
```csharp
public virtual void Reset()
```